[{"img": "images/team/oz.jpg", "name": "Anthony \"Oz\" Oslund", "title": "founder/creative director", "bio": "Minneapolis-based Songwriter/Bandleader for the last decade, presently for the group Lazy Scorsese. Contributing member to several NFT projects/communities since August 2020. \nCreated this project because it was the type of project he wanted to see happen as both an NFT collector, a music enthusiast, and as a platform to lift up other artists.", "twitter": "@Dkeyyoda", "instagram": "", "": ""}, {"img": "images/team/david.jpg", "name": "David Kozlovsky", "title": "lead digital artist", "bio": "Born in Czech Republic, attended Nemo Academy in Florence, Italy with a focus on Entertainment Design.\nDesign Workshops with Sandra Cleuzo, Stephen Silver, Terryl Withlatch, Bobby Chiu & Florian Satzinger. Huge passion for creating album covers!", "twitter": "", "instagram": "@deeptownbreath", "": ""}, {"img": "images/team/ryan.jpg", "name": "Ryan Meyers", "title": "lead developer", "bio": "He and his daughter created the first 100% Charity NFT. He’s developed smart contracts for numerous projects, custom Discord bots, and web3 integrations.\nHe's the lead dev at Lucky Maneki, Chief Anthrobotanist at Flower Girls, Dev/Dad @ #ForkHunger, and contributing member to several NFT projects.", "twitter": "@sreyeMnayR", "instagram": "", "": ""}, {"img": "images/team/james.jpg", "name": "James Jaison", "title": "marketing director", "bio": "Graduated from a top UK business school in 2021 and former president of one of the leading Investment and Finance Societies in Northern England. Currently developing his own NFT marketing start-up after falling in love with NFTs and the priority of value exchange in Web3. Experience working in sales, business development & marketing with a variety of organizations", "twitter": "", "instagram": "", "": ""}, {"img": "images/team/ash.jpg", "name": "Tishana “Ash” Hinds", "title": "community manager", "bio": "Business Analyst & Supermom by day, NFT enthusiast by night. Extensive background in customer service and passion for community building. Discord Mod for Sacred Skulls.", "twitter": "@ASHinTheMeta", "instagram": "", "": " "}, {"img": "images/team/marguerite.jpg", "name": "Marguerite Huss", "title": "web design", "bio": "A Minneapolis-based designer for the past 10 years, she's used the freedom of freelancing to nurture her love of travel. Most recent trip was working in Sicily for 3 months creating graphics and UI elements for a small web development company. She has a special love for logo design and works on and off part-time at a local independent print shop.", "twitter": "", "instagram": "", "": ""}, {"img": "images/team/adam.png", "name": "Adam K", "title": "cybersecurity", "bio": "Contractor/consultant in the Blockchain, Cloud and IT spaces, including System Architecture and Cybersecurity at Lucky Maneki DAO, and Development & Smart Contract Security Advisor at [redacted].\nEthical hacker and certified blockchain expert/blockchain security professional.", "twitter": "", "instagram": "", "": ""}, {"img": "images/team/chris.png", "name": "Chris McDaniel", "title": ".gif artist", "bio": "Motion Designer, Instafamous @TheGlitch.Og.\nAmassed over 129K followers for creating gorgeous psychedelic/cosmic .gifs.", "twitter": "", "instagram": "@TheGlitch.Og", "": ""}]